{
    "version": "https://jsonfeed.org/version/1",
    "title": "Keith Wagner - Book Notes",
    "home_page_url": "https://kpwags.com",
    "feed_url": "https://kpwags.com/rss/booknotes_atom.json",
    "description": "I'm a software developer, gamer, geek, amateur hockey player, aspiring writer, and a whole lot more. I enjoy tech, baseball, hockey, sci-fi and plenty more.",
    "author": {
        "name": "Keith Wagner",
        "url": "https://kpwags.com/"
    },
    "items": [
        {
            "id": "https://kpwags.com/books/doris-kearns-goodwin-team-of-rivals",
            "content_html": "\n            <div>\n                <p>This was a really fascinating look at Lincoln&#x27;s rise to the presidency. and how he ran the Union during America&#x27;s darkest hours.</p>\n<p>The book starts out by describing how both Lincoln and the three other presidential hopefuls in the 1860 Republican Primary race got to be on the ballot in 1860. Doris Kearns Goodwin does a fantastic job of describing the backgrounds of Abraham Lincoln, William Seward, Salmon Chase and Edward Bates and how each one of them got to where they were, their history in politics, and what their political viewpoints were.</p>\n<p>It was interesting to read how Lincoln wound up garnering enough support to win both the primary and then the presidency itself. While there were certain key events that ended up being strokes of luck, the book does a good job of describing Lincoln&#x27;s natural ability to find political angles to get the followers and support he needed.</p>\n<p>From a historical perspective, it&#x27;s interesting to read about how the former Whig party dissolved into the Republican Party in the 10 years prior to Lincoln&#x27;s inauguration. I had never realized how new the Republican party was when Lincoln became the first Republican president.</p>\n<p>It was interesting to read about how Lincoln built his cabinet. He nominated his rivals to his cabinet to get multiple different perspectives on the many tough decisions he had to deal with as President. In truth, many of his cabinet members didn&#x27;t get along and it was amazing to read how Lincoln was able to help keep Washington and the federal government together as the Civil War got started and then continued to be fought.</p>\n<p>The book also talks about how Lincoln was able to corral his cabinet and prepare the country for his Emancipation Proclamation, and then later get the votes together for passage of the 13th amendment ending slavery permanently.</p>\n<p>I really appreciated Doris&#x27; writing, It gave me a much better understanding of the kind of person Lincoln was and why he made such a great president aside from him keeping the country together and ending slavery.</p>\n            </div>\n        ",
            "url": "https://kpwags.com/books/doris-kearns-goodwin-team-of-rivals",
            "title": "Team of Rivals: The Political Genius of Abraham Lincoln by Doris Kearns Goodwin",
            "summary": "This was a really fascinating look at Lincoln&#39;s rise to the presidency. and how he ran the Union during America&#39;s darkest hours.",
            "date_modified": "2023-10-13T00:00:00.000Z",
            "author": {
                "name": "Keith Wagner",
                "url": "https://kpwags.com/"
            }
        },
        {
            "id": "https://kpwags.com/books/erik-larson-dead-wake",
            "content_html": "\n            <div>\n                <p>This book was an interesting read looking at one of the biggest victims of unrestricted submarine warfare. It was also the start of the events that would bring the US into World War I two years later.</p>\n<p>The book Bounces between passenger and crew stories from the <em>Lusitania</em>, the path of <em>U-20</em> and Captain Lieutenant Walther Schwieger, who would sink the <em>Lusitania</em>.</p>\n<p>While talking about Schwieger and the German U-Boat fleet, this line stood out to me:</p>\n<blockquote>\n<p>Unlike large surface craft, a U-boat came to reflect the character and personality of its commander, as though the boat were a suit of steel tailored just for him. This arose from the fact that while on distant patrol the captain received no orders from superiors and had more direct control over his own men than would, say, an admiral aboard a flagship, with a fleet of ships and thousands of men under his command. There were cruel boats and chivalrous boats, lazy boats and energetic boats. Some captains made no attempt to save the lives of merchant seamen; others went so far as to tow lifeboats toward land. One U-boat commander sent the captain of a torpedoed ship three bottles of wine to ease the long row ashore.</p>\n</blockquote>\n<p>Could you imagine being a captain of a ship just sunk by a submarine, and the sub captain pops up and offers you wine?</p>\n<p>The book also talks about how British Intelligence had broken German codes and were tracking <em>U-20</em> and were generally aware of where it was and what it was doing, but had neglected to alert the <em>Lusitania</em> or send any of their warships to help escort it to Liverpool or an alternate port.</p>\n<p>A naval historian, Patrick Beesley later even pointed this out.</p>\n<blockquote>\n<p>&quot;As an Englishman and a lover of the Royal Navy,&quot; he said, &quot;I would prefer to attribute this failure to negligence, even gross negligence, rather than to a conspiracy deliberately to endanger the ship.&quot; But, he said, &quot;on the basis of the considerable volume of information which is now available, I am reluctantly compelled to state that on balance, the most likely explanation is that there was indeed a plot, however imperfect, to endanger the <em>Lusitania</em> in order to involve the United States in the war.&quot; So much was done for the Orion and other warships, he wrote, but nothing for the <em>Lusitania</em>. He struggled with this. No matter how he arranged the evidence, he came back to conspiracy.&quot;</p>\n</blockquote>\n<p>It caps off what was an absolute tragedy costing the lives of almost 1,200 civilians. Carrying munitions bound for the frontlines on a passenger ship is questionable at best, but the lack of escort, or even actionable warnings being sent to the <em>Lusitania</em> after being specifically threatened by Germany should be criminal.</p>\n<p>Morals aside, it was a compelling read. It was interesting to hear all the different stories from some of the passengers on board.</p>\n            </div>\n        ",
            "url": "https://kpwags.com/books/erik-larson-dead-wake",
            "title": "Dead Wake: The Last Crossing of the Lusitania by Erik Larson",
            "summary": "This book was an interesting read looking at one of the biggest victims of unrestricted submarine warfare. It was also the start of the events that would bring the US into World War I two years later.",
            "date_modified": "2023-09-01T00:00:00.000Z",
            "author": {
                "name": "Keith Wagner",
                "url": "https://kpwags.com/"
            }
        }
    ]
}